performance-blazedemo/relatorio-carga/statistics.json
{
  "03 - Selecionar voo (purchase)" : {
    "transaction" : "03 - Selecionar voo (purchase)",
    "sampleCount" : 17562,
    "errorCount" : 112,
    "errorPct" : 0.63774055,
    "meanResTime" : 567.339426033485,
    "medianResTime" : 364.0,
    "minResTime" : 232.0,
    "maxResTime" : 41376.0,
    "pct1ResTime" : 496.0,
    "pct2ResTime" : 566.0,
    "pct3ResTime" : 1122.3299999999908,
    "throughput" : 55.32209796818396,
    "receivedKBytesPerSec" : 361.531540400063,
    "sentKBytesPerSec" : 15.835878435580407
  },
  "01 - Home" : {
    "transaction" : "01 - Home",
    "sampleCount" : 17752,
    "errorCount" : 94,
    "errorPct" : 0.5295178,
    "meanResTime" : 538.917361424064,
    "medianResTime" : 358.0,
    "minResTime" : 227.0,
    "maxResTime" : 32126.0,
    "pct1ResTime" : 501.0,
    "pct2ResTime" : 586.0,
    "pct3ResTime" : 1099.570000000036,
    "throughput" : 55.80635020433826,
    "receivedKBytesPerSec" : 258.7611501886199,
    "sentKBytesPerSec" : 6.396757603740961
  },
  "02 - Escolher voos (reserve)" : {
    "transaction" : "02 - Escolher voos (reserve)",
    "sampleCount" : 17660,
    "errorCount" : 103,
    "errorPct" : 0.58323896,
    "meanResTime" : 540.6563420158559,
    "medianResTime" : 363.0,
    "minResTime" : 240.0,
    "maxResTime" : 41129.0,
    "pct1ResTime" : 489.0,
    "pct2ResTime" : 553.9500000000007,
    "pct3ResTime" : 912.0,
    "throughput" : 55.73439373855962,
    "receivedKBytesPerSec" : 400.35705277468753,
    "sentKBytesPerSec" : 13.419446877169728
  },
  "04 - Confirmar compra (confirmation)" : {
    "transaction" : "04 - Confirmar compra (confirmation)",
    "sampleCount" : 17455,
    "errorCount" : 129,
    "errorPct" : 0.73904324,
    "meanResTime" : 560.0101403609302,
    "medianResTime" : 364.0,
    "minResTime" : 223.0,
    "maxResTime" : 40086.0,
    "pct1ResTime" : 497.0,
    "pct2ResTime" : 566.0,
    "pct3ResTime" : 1140.1999999999935,
    "throughput" : 55.11107462648867,
    "receivedKBytesPerSec" : 310.21734790187986,
    "sentKBytesPerSec" : 22.68477444083808
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 70429,
    "errorCount" : 438,
    "errorPct" : 0.6219029,
    "meanResTime" : 551.668261653579,
    "medianResTime" : 371.0,
    "minResTime" : 223.0,
    "maxResTime" : 41376.0,
    "pct1ResTime" : 554.0,
    "pct2ResTime" : 695.0,
    "pct3ResTime" : 28179.460000000086,
    "throughput" : 220.7729514029297,
    "receivedKBytesPerSec" : 1323.4356320442319,
    "sentKBytesPerSec" : 57.98798988318584
  }
}