performance-blazedemo/relatorio-pico/statistics.json
{
  "03 - Selecionar voo (purchase)" : {
    "transaction" : "03 - Selecionar voo (purchase)",
    "sampleCount" : 7778,
    "errorCount" : 5,
    "errorPct" : 0.06428388,
    "meanResTime" : 1217.485728979173,
    "medianResTime" : 734.5,
    "minResTime" : 258.0,
    "maxResTime" : 30016.0,
    "pct1ResTime" : 2579.1000000000004,
    "pct2ResTime" : 3389.0,
    "pct3ResTime" : 6527.720000000001,
    "throughput" : 26.076257463649803,
    "receivedKBytesPerSec" : 170.9315244441865,
    "sentKBytesPerSec" : 7.508339769561384
  },
  "01 - Home" : {
    "transaction" : "01 - Home",
    "sampleCount" : 8076,
    "errorCount" : 6,
    "errorPct" : 0.0742942,
    "meanResTime" : 1346.5175829618568,
    "medianResTime" : 795.0,
    "minResTime" : 249.0,
    "maxResTime" : 30003.0,
    "pct1ResTime" : 2799.3,
    "pct2ResTime" : 3867.899999999998,
    "pct3ResTime" : 8161.339999999975,
    "throughput" : 26.91766713551492,
    "receivedKBytesPerSec" : 125.00695252244805,
    "sentKBytesPerSec" : 3.099920142337664
  },
  "02 - Escolher voos (reserve)" : {
    "transaction" : "02 - Escolher voos (reserve)",
    "sampleCount" : 7931,
    "errorCount" : 2,
    "errorPct" : 0.025217501,
    "meanResTime" : 1221.9678476862935,
    "medianResTime" : 732.0,
    "minResTime" : 251.0,
    "maxResTime" : 30010.0,
    "pct1ResTime" : 2635.8,
    "pct2ResTime" : 3393.7999999999975,
    "pct3ResTime" : 6473.640000000007,
    "throughput" : 26.56052725878346,
    "receivedKBytesPerSec" : 191.4122905388378,
    "sentKBytesPerSec" : 6.43181662151165
  },
  "04 - Confirmar compra (confirmation)" : {
    "transaction" : "04 - Confirmar compra (confirmation)",
    "sampleCount" : 7629,
    "errorCount" : 1465,
    "errorPct" : 19.203041,
    "meanResTime" : 1214.608074452744,
    "medianResTime" : 704.0,
    "minResTime" : 259.0,
    "maxResTime" : 23612.0,
    "pct1ResTime" : 2613.0,
    "pct2ResTime" : 3353.5,
    "pct3ResTime" : 6598.099999999999,
    "throughput" : 25.59757881598196,
    "receivedKBytesPerSec" : 144.43380214554617,
    "sentKBytesPerSec" : 10.596218871210189
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 31414,
    "errorCount" : 1478,
    "errorPct" : 4.704909,
    "meanResTime" : 1251.090341885784,
    "medianResTime" : 1117.0,
    "minResTime" : 249.0,
    "maxResTime" : 30016.0,
    "pct1ResTime" : 2965.0,
    "pct2ResTime" : 3828.9000000000015,
    "pct3ResTime" : 7650.880000000019,
    "throughput" : 104.68437065745144,
    "receivedKBytesPerSec" : 628.8026783943942,
    "sentKBytesPerSec" : 27.486522999470143
  }
}